emacs/.emacs.d/init.old.org
#+title: GNU Emacs configuration
#+author: Marc Wenzlawski
#+email: marcwenzlawski@gmail.com
#+language: en
#+startup: overview indent
#+property: header-args :results none :tangle yes

* Inspiration
- [[https://github.com/jacmoe/.doom.d/blob/master/config.el][.doom.d/config.el at master · jacmoe/.doom.d]]
- [[https://irreal.org/blog/][Irreal]]
- [[https://robbmann.io/emacsd/]]
- [[https://github.com/purcell/emacs.d]]
- [[https://protesilaos.com/emacs/dotemacs]]
- [[https://matthewbauer.us/bauer/]]
- [[https://www.scss.tcd.ie/~sulimanm/emacs/]]
- [[https://robbmann.io/emacsd/]]
- [[https://panadestein.github.io/emacsd/]]
- [[https://github.com/oantolin/emacs-config]]
- [[https://www.lucacambiaghi.com/vanilla-emacs/readme.html]]
- https://github.com/howardabrams/dot-files/
- https://github.com/yantar92/emacs-config/tree/master
* The =early-init.el= file
** Set the initial frame dimensions

#+begin_src elisp :tangle "early-init.el"
;;; -*- lexical-binding: t; no-byte-compile: t -*-
;;; early-init.el --- Early Init File
;; NOTE: early-init.el is generated from config.org.
;; Please edit that file instead.

(add-to-list 'initial-frame-alist '(height . 80))
(add-to-list 'default-frame-alist '(height . 80))
(add-to-list 'initial-frame-alist '(width . 140))
(add-to-list 'default-frame-alist '(width . 140))
#+end_src

** Basic frame settings

#+begin_src emacs-lisp :tangle "early-init.el"
(setq frame-resize-pixelwise t
      frame-inhibit-implied-resize t
      frame-title-format '("what the %b")
      ring-bell-function 'ignore
      use-dialog-box t ; only for mouse events, which I seldom use
      use-file-dialog nil
      use-short-answers t
      inhibit-splash-screen t
      inhibit-startup-screen t
      inhibit-x-resources t
      inhibit-startup-echo-area-message user-login-name ; read the docstring
      inhibit-startup-buffer-menu t)

;; Prevent the glimpse of un-styled Emacs by disabling these UI elements early.
(push '(menu-bar-lines . 0) default-frame-alist)
(push '(tool-bar-lines . 0) default-frame-alist)
(push '(vertical-scroll-bars) default-frame-alist)

;; Disable GUI elements
(menu-bar-mode -1)
(add-hook 'after-init-hook (lambda nil (menu-bar-mode -1)))
(scroll-bar-mode -1)
(tool-bar-mode -1)
#+end_src

** Tweaking garbage collection during startup

#+begin_src emacs-lisp :tangle "early-init.el"
;; Temporarily increase the garbage collection threshold.  These
;; changes help shave off about half a second of startup time.  The
;; `most-positive-fixnum' is DANGEROUS AS A PERMANENT VALUE.  See the
;; `emacs-startup-hook' a few lines below for what I actually use.
(setq gc-cons-threshold most-positive-fixnum
      gc-cons-percentage 0.6)

;; Same idea as above for the `file-name-handler-alist' and the
;; `vc-handled-backends' with regard to startup speed optimisation.
;; Here I am storing the default value with the intent of restoring it
;; via the `emacs-startup-hook'.
(defvar prot-emacs--file-name-handler-alist file-name-handler-alist)
(defvar prot-emacs--vc-handled-backends vc-handled-backends)

(setq file-name-handler-alist nil
      vc-handled-backends nil)

(add-hook 'emacs-startup-hook
          (lambda ()
            (setq gc-cons-threshold (* 1024 1024 20)
                  gc-cons-percentage 0.2
                  file-name-handler-alist prot-emacs--file-name-handler-alist
                  vc-handled-backends prot-emacs--vc-handled-backends)))
#+end_src
** Initialse the package cache

This version is taken from Doom.

#+begin_src elisp :tangle no
;; In Emacs 27+, package initialization occurs before `user-init-file' is
;; loaded, but after `early-init-file'. Doom handles package initialization, so
;; we must prevent Emacs from doing it early!
(setq package-enable-at-startup nil)
;; Do not allow loading from the package cache (same reason).
(setq package-quickstart nil)
(require 'use-package-ensure)
(setq use-package-always-ensure t)
#+end_src

This from Prot.

#+begin_src emacs-lisp :tangle "early-init.el"
;; Initialise installed packages at this early stage, by using the
;; available cache.  I had tried a setup with this set to nil in the
;; early-init.el, but (i) it ended up being slower and (ii) various
;; package commands, like `describe-package', did not have an index of
;; packages to work with, requiring a `package-refresh-contents'.
(setq package-enable-at-startup t)
#+end_src
** Prevent unwanted runtime builds

#+begin_src elisp :tangle "early-init.el"
;; Prevent unwanted runtime builds in gccemacs (native-comp); packages are
;; compiled ahead-of-time when they are installed and site files are compiled
;; when gccemacs is installed.
(setq comp-deferred-compilation nil)

;;; early-init.el ends here
#+end_src
** prevent loud startup
#+begin_src elisp
(setq warning-minimum-level :emergency)
#+end_src
** avoid initial flash of light

#+begin_src emacs-lisp :tangle "early-init.el"
;; This is bound to MacOS. In the future, there should be an OS
;; agnostic way of calling these functions. This would be handled by
;; making a boolean checking for OS type at startup and then assigning
;; respective variables to the desktop commands. That way we won't
;; have to constantly do the checking for OS, just do it once.
(defun mw/theme-gsettings-dark-p ()
  "Return non-nil if defaults (MACOS) has a dark theme.
Return nil if the OS is not darwin"
  (if (eq system-type 'darwin)
      (string-match-p
       "Dark"
       (shell-command-to-string "defaults read -g AppleInterfaceStyle"))))

(defun mw/avoid-initial-flash-of-light ()
  "Avoid flash of light when starting Emacs, if needed.
New frames are instructed to call
`prot-emacs-re-enable-frame-theme'."
  (when (mw/theme-gsettings-dark-p)
    (set-face-attribute 'default nil :background "#000000"
                        :foreground "#ffffff")
    (set-face-attribute 'mode-line nil :background "#000000"
                        :foreground "#ffffff" :box 'unspecified)))

(setq mode-line-format nil)
(mw/avoid-initial-flash-of-light)
#+end_src

* The =init.el= file
** Create emacs backups in separate dict

#+begin_src elisp
(make-directory "~/.emacs_backups/" t)
(make-directory "~/.emacs_autosave/" t)
(setq auto-save-file-name-transforms '((".*" "~/.emacs_autosave/" t)))
(setq backup-directory-alist '(("." . "~/.emacs_backups/")))
#+end_src

** Disable backups and lockfiles

#+begin_src elisp
(setq make-backup-files nil)
(setq backup-inhibited nil) ; Not sure if needed, given `make-backup-files'
(setq create-lockfiles nil)
#+end_src

** Make native compilation silent

#+begin_src elisp
;; Make native compilation silent and prune its cache.
(when (native-comp-available-p)
  (setq native-comp-async-report-warnings-errors 'silent) ; Emacs 28 with native compilation
  (setq native-compile-prune-cache t)) ; Emacs 29
#+end_src

** Disable the custom file

#+begin_src elisp
;; Disable the damn thing by making it disposable.
(setq custom-file (make-temp-file "emacs-custom-"))
#+end_src

** Enable all diabled commands

#+begin_src elisp
(setq disabled-command-function nil)
#+end_src

** Always start with the =*scratch*= buffer

#+begin_src elisp
;; Always start with *scratch*
;;(setq initial-buffer-choice t)
#+end_src

** Add the =site-lisp= directory to the load-path

Maybe also add the =mw-emacs-modules= in case I decide to not use a single file
for configuration.

#+begin_src elisp
(mapc
 (lambda (string)
   (add-to-list 'load-path (locate-user-emacs-file string)))
 '("site-lisp" "mw-emacs-modules"))
#+end_src

** Settings for packages (=package.el= and =use-package=)

Here still need to consult the manual for the best defaults for use-package.

#+begin_src emacs-lisp
;;;; Packages

(require 'package)

(setq package-vc-register-as-project nil) ; Emacs 30

(add-hook 'package-menu-mode-hook #'hl-line-mode)

;; Also read: <https://protesilaos.com/codelog/2022-05-13-emacs-elpa-devel/>
(setq package-archives
      '(("gnu-elpa" . "https://elpa.gnu.org/packages/")
        ("gnu-elpa-devel" . "https://elpa.gnu.org/devel/")
        ("nongnu" . "https://elpa.nongnu.org/nongnu/")
        ("melpa" . "https://melpa.org/packages/")))

;; Highest number gets priority (what is not mentioned has priority 0)
(setq package-archive-priorities
      '(("gnu-elpa" . 3)
        ("melpa" . 2)
        ("nongnu" . 1)))

;; NOTE 2023-08-21: I build Emacs from source, so I always get the
;; latest version of built-in packages.  However, this is a good
;; solution to set to non-nil if I ever switch to a stable release.
(setq package-install-upgrade-built-in nil)

(require 'use-package-ensure)
(setq use-package-always-ensure nil)
#+end_src

*** straight

#+begin_src elisp
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name
        "straight/repos/straight.el/bootstrap.el"
        (or (bound-and-true-p straight-base-dir)
            user-emacs-directory)))
      (bootstrap-version 7))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))
(straight-use-package 'use-package)
#+end_src
** Declare all themes as safe

#+begin_src elisp
(setq custom-safe-themes t)
#+end_src

Containing all package and other configuration

* The emacs modules
:PROPERTIES:
:VISIBILITY: children
:END:
** user interface
*** Theme

#+begin_src elisp
(setq custom-safe-themes t)
(defalias 'mw/apply-theme-change 'mw/modus-theme-change)

(add-to-list 'ns-system-appearance-change-functions 'mw/apply-theme-change)
;; (add-to-list 'after-make-frame-functions '(lambda (_)
;; (my/apply-theme-change ns-system-appearance))) ;; DOES NOT WORK
(push '(lambda (_) (mw/apply-theme-change ns-system-appearance)) (cdr (last after-make-frame-functions)))
(use-package ef-themes)
(use-package color-theme-modern)
#+end_src

**** default theme
This is done using the list 'ns-system-appearance-change-functions'. Also this
has to be done for every new frame, so we have to hook into the
'after-make-frame-functions'. For some reason adding it to the top of the list
does not work, so we have to append it.

#+begin_src elisp :tangle no
(defun mw/theme-default-light ()
  "Set the default theme to light"
  (interactive)
  (set-foreground-color "black")
  (set-background-color "white"))

(defun mw/theme-default-dark ()
  "Set the default theme to dark"
  (interactive)
  (set-foreground-color "white")
  (set-background-color "black"))

(defun mw/default-theme-change (appearance)
  "Load theme, taking current system APPEARANCE into consideration."
  (mapc #'disable-theme custom-enabled-themes)
  (pcase appearance
    ('light (mw/theme-default-light))
    ('dark  (mw/theme-default-dark))))
#+end_src

